Revit 2027 API
ParameterTypeId.CurveIsDetail Property
 "Detail Line"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveIsDetail { get; }
Public Shared ReadOnly Property CurveIsDetail As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveIsDetail {
	ForgeTypeId^ get ();
}
static member CurveIsDetail : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace